API_Automation_HTTPClient_Soap/API_Automation_HTTPClient_Soap/apidemoproject/test-output/Default suite/Default test.html

<html>
<head>
<title>TestNG:  Default test</title>
<link href="../testng.css" rel="stylesheet" type="text/css" />
<link href="../my-testng.css" rel="stylesheet" type="text/css" />

<style type="text/css">
.log { display: none;} 
.stack-trace { display: none;} 
</style>
<script type="text/javascript">
<!--
function flip(e) {
  current = e.style.display;
  if (current == 'block') {
    e.style.display = 'none';
    return 0;
  }
  else {
    e.style.display = 'block';
    return 1;
  }
}

function toggleBox(szDivId, elem, msg1, msg2)
{
  var res = -1;  if (document.getElementById) {
    res = flip(document.getElementById(szDivId));
  }
  else if (document.all) {
    // this is the way old msie versions work
    res = flip(document.all[szDivId]);
  }
  if(elem) {
    if(res == 0) elem.innerHTML = msg1; else elem.innerHTML = msg2;
  }

}

function toggleAllBoxes() {
  if (document.getElementsByTagName) {
    d = document.getElementsByTagName('div');
    for (i = 0; i < d.length; i++) {
      if (d[i].className == 'log') {
        flip(d[i]);
      }
    }
  }
}

// -->
</script>

</head>
<body>
<h2 align='center'>Default test</h2><table border='1' align="center">
<tr>
<td>Tests passed/Failed/Skipped:</td><td>2/0/0</td>
</tr><tr>
<td>Started on:</td><td>Tue Apr 11 13:42:58 EDT 2023</td>
</tr>
<tr><td>Total time:</td><td>0 seconds (660 ms)</td>
</tr><tr>
<td>Included groups:</td><td></td>
</tr><tr>
<td>Excluded groups:</td><td></td>
</tr>
</table><p/>
<small><i>(Hover the method name to see the test class name)</i></small><p/>
<table width='100%' border='1' class='invocation-passed'>
<tr><td colspan='4' align='center'><b>PASSED TESTS</b></td></tr>
<tr><td><b>Test method</b></td>
<td width="30%"><b>Exception</b></td>
<td width="10%"><b>Time (seconds)</b></td>
<td><b>Instance</b></td>
</tr>
<tr>
<td title='com.api.automation.apidemoproject.SoapTest.calculator_Multiplication()'><b>calculator_Multiplication</b><br>Test class: com.api.automation.apidemoproject.SoapTest<br>Test method: Sample  call<br/>
<a href="#Output-987187798" onClick='toggleBox("Output-987187798", this, "Show output", "Hide output");'>Show output</a>

<a href="#Output-987187798" onClick="toggleAllBoxes();">Show all outputs</a>
<div class='log' id="Output-987187798">
payload <?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Body>
<Multiply xmlns="http://tempuri.org/">
<intA>500</intA>
<intB>200</intB>
</Multiply>
</soap:Body>
</soap:Envelope> <br/>
property value for calculator:http://www.dneonline.com/calculator.asmx<br/>
property value for Content-Type:text/xml; charset=utf-8<br/>
Response Code : 200<br/>
recent services <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><MultiplyResponse xmlns="http://tempuri.org/"><MultiplyResult>100000</MultiplyResult></MultiplyResponse></soap:Body></soap:Envelope><br/>
Http code is   200<br/>
response payload is   <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><MultiplyResponse xmlns="http://tempuri.org/"><MultiplyResult>100000</MultiplyResult></MultiplyResponse></soap:Body></soap:Envelope><br/>
</div>
</td>
<td></td>
<td>0</td>
<td>com.api.automation.apidemoproject.SoapTest@23941fb4</td></tr>
<tr>
<td title='com.api.automation.apidemoproject.SoapTest.numberConversion()'><b>numberConversion</b><br>Test class: com.api.automation.apidemoproject.SoapTest<br>Test method: Sample PUT call<br/>
<a href="#Output-167100229" onClick='toggleBox("Output-167100229", this, "Show output", "Hide output");'>Show output</a>

<a href="#Output-167100229" onClick="toggleAllBoxes();">Show all outputs</a>
<div class='log' id="Output-167100229">
payload <?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <NumberToWords xmlns="http://www.dataaccess.com/webservicesserver/">
      <ubiNum>500</ubiNum>
    </NumberToWords>
  </soap:Body>
</soap:Envelope> <br/>
property value for numberConversion:https://www.dataaccess.com/webservicesserver/NumberConversion.wso<br/>
property value for Content-Type:text/xml; charset=utf-8<br/>
Response Code : 200<br/>
recent services <?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <m:NumberToWordsResponse xmlns:m="http://www.dataaccess.com/webservicesserver/">
      <m:NumberToWordsResult>five hundred </m:NumberToWordsResult>
    </m:NumberToWordsResponse>
  </soap:Body>
</soap:Envelope><br/>
Http code is   200<br/>
response payload is   <?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <m:NumberToWordsResponse xmlns:m="http://www.dataaccess.com/webservicesserver/">
      <m:NumberToWordsResult>five hundred </m:NumberToWordsResult>
    </m:NumberToWordsResponse>
  </soap:Body>
</soap:Envelope><br/>
</div>
</td>
<td></td>
<td>0</td>
<td>com.api.automation.apidemoproject.SoapTest@23941fb4</td></tr>
</table><p>
</body>
</html>