docs/data/attachments/1128297721b13cae.html

<div>POST to http://www.dneonline.com/calculator.asmx</div>

    <h4>Body</h4>
    <div>
    <pre class="preformated-text">
&lt;soap:Envelope xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot; xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
  &lt;soap:Body&gt;
    &lt;Add xmlns=&quot;http://tempuri.org/&quot;&gt;
      &lt;intA&gt;3&lt;/intA&gt;
      &lt;intB&gt;4&lt;/intB&gt;
    &lt;/Add&gt;
  &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;    </pre>
    </div>

    <h4>Headers</h4>
    <div>
            <div>Accept: text/xml</div>
            <div>Content-Type: text/xml; charset=ISO-8859-1</div>
    </div>



    <h4>Curl</h4>
    <div>
        curl -v -X POST &#39;http://www.dneonline.com/calculator.asmx&#39; -H &#39;Accept: text/xml&#39; -H &#39;Content-Type: text/xml; charset=ISO-8859-1&#39; -d &#39;&lt;soap:Envelope xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot; xmlns:xsd=&quot;http://www.w3.org/2001/XMLSchema&quot; xmlns:soap=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
  &lt;soap:Body&gt;
    &lt;Add xmlns=&quot;http://tempuri.org/&quot;&gt;
      &lt;intA&gt;3&lt;/intA&gt;
      &lt;intB&gt;4&lt;/intB&gt;
    &lt;/Add&gt;
  &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;&#39;
    </div>

