ETL/Test/ETL.log

[]=>[2016-04-15 15:02:50] [DEBUG] [com.outsidethebox.etl.ETL.init] - Validating ETL xml...
[]=>[2016-04-15 15:02:51] [DEBUG] [com.outsidethebox.etl.ETL.init] - ETL xml file has been validated.
[]=>[2016-04-15 15:02:51] [DEBUG] [com.outsidethebox.etl.ETL.initProperties] - Loading properties...
[]=>[2016-04-15 15:02:51] [DEBUG] [com.outsidethebox.etl.ETL.initProperties] - Loaded [0] properties
[]=>[2016-04-15 15:02:51] [DEBUG] [com.outsidethebox.etl.ETL.initDBConnections] - Loading database connections...
[]=>[2016-04-15 15:02:51] [DEBUG] [com.outsidethebox.etl.ETL.initDBConnections] - Loaded [1] database connections
[]=>[2016-04-15 15:02:51] [DEBUG] [com.outsidethebox.etl.ETL.init] - ETL object has been parsed.
[]=>[2016-04-15 15:02:51] [DEBUG] [com.outsidethebox.etl.ETL.iterateProcess] - Executing SOAPWebservice ID[s1], URL[http://www.dneonline.com/calculator.asmx], Input[<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Add xmlns="http://tempuri.org/">
      <intA>5</intA>
      <intB>6</intB>
    </Add>
  </soap:Body>
</soap:Envelope>], Action[http://tempuri.org/Add], Input[<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Add xmlns="http://tempuri.org/">
      <intA>5</intA>
      <intB>6</intB>
    </Add>
  </soap:Body>
</soap:Envelope>]...
[]=>[2016-04-15 15:02:51] [DEBUG] [com.outsidethebox.etl.ETL.execute] - [RAW] SOAP URL : http://www.dneonline.com/calculator.asmx
[]=>[2016-04-15 15:02:51] [DEBUG] [com.outsidethebox.etl.ETL.execute] - [GEN] SOAP URL : http://www.dneonline.com/calculator.asmx
[]=>[2016-04-15 15:02:51] [DEBUG] [com.outsidethebox.etl.ETL.execute] - [RAW] SOAP Action : http://tempuri.org/Add
[]=>[2016-04-15 15:02:51] [DEBUG] [com.outsidethebox.etl.ETL.execute] - [GEN] SOAP Action : http://tempuri.org/Add
[]=>[2016-04-15 15:02:56] [DEBUG] [com.outsidethebox.etl.ETL.execute] - [RAW] Input : <?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Add xmlns="http://tempuri.org/">
      <intA>5</intA>
      <intB>6</intB>
    </Add>
  </soap:Body>
</soap:Envelope>
[]=>[2016-04-15 15:02:57] [DEBUG] [com.outsidethebox.etl.ETL.execute] - [GEN] Input : <?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Add xmlns="http://tempuri.org/">
      <intA>5</intA>
      <intB>6</intB>
    </Add>
  </soap:Body>
</soap:Envelope>
[]=>[2016-04-15 15:03:03] [DEBUG] [com.outsidethebox.etl.ETL.execute] - Output : <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><AddResponse xmlns="http://tempuri.org/"><AddResult>11</AddResult></AddResponse></soap:Body></soap:Envelope>
[]=>[2016-04-15 15:03:17] [DEBUG] [com.outsidethebox.etl.ETL.execute] - Output-XML [false]
[/soap:Envelope/soap:Body/AddResponse/AddResult='11']
[]=>[2016-04-15 15:04:42] [DEBUG] [com.outsidethebox.etl.ETL.init] - Validating ETL xml...
[]=>[2016-04-15 15:04:43] [DEBUG] [com.outsidethebox.etl.ETL.init] - ETL xml file has been validated.
[]=>[2016-04-15 15:04:43] [DEBUG] [com.outsidethebox.etl.ETL.initProperties] - Loading properties...
[]=>[2016-04-15 15:04:43] [DEBUG] [com.outsidethebox.etl.ETL.initProperties] - Loaded [0] properties
[]=>[2016-04-15 15:04:43] [DEBUG] [com.outsidethebox.etl.ETL.initDBConnections] - Loading database connections...
[]=>[2016-04-15 15:04:43] [DEBUG] [com.outsidethebox.etl.ETL.initDBConnections] - Loaded [1] database connections
[]=>[2016-04-15 15:04:43] [DEBUG] [com.outsidethebox.etl.ETL.init] - ETL object has been parsed.
[]=>[2016-04-15 15:04:43] [DEBUG] [com.outsidethebox.etl.ETL.iterateProcess] - Executing SOAPWebservice ID[s1], URL[http://www.dneonline.com/calculator.asmx], Input[<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Add xmlns="http://tempuri.org/">
      <intA>5</intA>
      <intB>6</intB>
    </Add>
  </soap:Body>
</soap:Envelope>], Action[http://tempuri.org/Add], Input[<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Add xmlns="http://tempuri.org/">
      <intA>5</intA>
      <intB>6</intB>
    </Add>
  </soap:Body>
</soap:Envelope>]...
[]=>[2016-04-15 15:04:43] [DEBUG] [com.outsidethebox.etl.ETL.execute] - [RAW] SOAP URL : http://www.dneonline.com/calculator.asmx
[]=>[2016-04-15 15:04:43] [DEBUG] [com.outsidethebox.etl.ETL.execute] - [GEN] SOAP URL : http://www.dneonline.com/calculator.asmx
[]=>[2016-04-15 15:04:43] [DEBUG] [com.outsidethebox.etl.ETL.execute] - [RAW] SOAP Action : http://tempuri.org/Add
[]=>[2016-04-15 15:04:43] [DEBUG] [com.outsidethebox.etl.ETL.execute] - [GEN] SOAP Action : http://tempuri.org/Add
[]=>[2016-04-15 15:04:47] [DEBUG] [com.outsidethebox.etl.ETL.execute] - [RAW] Input : <?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Add xmlns="http://tempuri.org/">
      <intA>5</intA>
      <intB>6</intB>
    </Add>
  </soap:Body>
</soap:Envelope>
[]=>[2016-04-15 15:04:48] [DEBUG] [com.outsidethebox.etl.ETL.execute] - [GEN] Input : <?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <Add xmlns="http://tempuri.org/">
      <intA>5</intA>
      <intB>6</intB>
    </Add>
  </soap:Body>
</soap:Envelope>
[]=>[2016-04-15 15:04:51] [DEBUG] [com.outsidethebox.etl.ETL.execute] - Output : <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><AddResponse xmlns="http://tempuri.org/"><AddResult>11</AddResult></AddResponse></soap:Body></soap:Envelope>
[]=>[2016-04-15 15:04:53] [DEBUG] [com.outsidethebox.etl.ETL.execute] - Output-XML [false]
[/soap:Envelope/soap:Body/AddResponse/AddResult='11']
